 

class உயிர்வரின்:
    def __init__(self,சொல்):
        self.சொல் = சொல்

    def உருப்பு(self):
        return self.சொல்

    def உள்ளதா(self):
        pass

    def இடு(self, *args, **kwargs):

        கொடு = []

        for மொழி in range(len(args)-1):
            அந்தமொழி =  args[மொழி]
            அடுத்தமொழி =  args[மொழி+1]

            if அடுத்தமொழி.உயிர்முதலா():
                if அந்தமொழி.உயிர்முதல்() in ['இ','ஈ','ஐ']:
                    அந்தமொழி.எழுத்துக்கள் = அந்தமொழி.எழுத்துக்கள் + ['வ்']
                else:
                    அந்தமொழி.எழுத்துக்கள் = அந்தமொழி.எழுத்துக்கள் + ['ய்']

            கொடு.append(அந்தமொழி)
        else:
            கொடு.append(args[-1])

        return கொடு


