
# TODO update variables and function opentamil

உயிரெழுத்துக்கள் = ["அ","ஆ","இ","ஈ","உ","ஊ","எ","ஏ","ஐ","ஒ","ஓ","ஔ"]

உயிர்குறில் = ["அ","இ","உ","எ","ஒ"]

உயிர்நெடில் = ["ஆ","ஈ","ஊ","ஏ","ஐ","ஓ","ஔ"]

மெய்யெழுத்துக்கள் = ["க்","ங்","ச்","ஞ்","ட்","ண்","த்","ந்","ப்","ம்","ய்","ர்","ல்","வ்","ழ்","ள்","ற்","ன்"]

வல்லெழுத்துக்கள் = ["க்","ச்","ட்","த்","ப்","ற்"]

மெல்லெழுத்துக்கள் = ["ங்","ஞ்","ண்","ந்", "ம்","ன்"]

இடையின_எழுத்துக்கள் = ["ய்","ர்","ல்","வ்","ள்", "ழ்",]


குற்றெழுத்துகள் = ["அ","இ","உ","எ","ஒ"]

நெட்டெழுத்துகள் = ["ஆ","ஈ","ஊ","ஏ","ஐ","ஓ","ஔ"]


குற்றியலுகரம் =   ["கு","ஙு","சு","ஞு","டு","ணு","து","நு","பு","மு","யு","ரு","லு","வு","ழு","ளு","று","னு"]

உயிர்மெய்கள் = [
"க","கா","கி","கீ","கு","கூ","கெ","கே","கை","கொ","கோ","கௌ",
"ங","ஙா","ஙி","ஙீ","ஙு","ஙூ","ஙெ","ஙே","ஙை","ஙொ","ஙோ","ஙௌ",
"ச","சா","சி","சீ","சு","சூ","செ","சே","சை","சொ","சோ","சௌ",
"ஞ","ஞா","ஞி","ஞீ","ஞு","ஞூ","ஞெ","ஞே","ஞை","ஞொ","ஞோ","ஞௌ",
"ட","டா","டி","டீ","டு","டூ","டெ","டே","டை","டொ","டோ","டௌ",
"ண","ணா","ணி","ணீ","ணு","ணூ","ணெ","ணே","ணை","ணொ","ணோ","ணௌ",
"த","தா","தி","தீ","து","தூ","தெ","தே","தை","தொ","தோ","தௌ",
"ந","நா","நி","நீ","நு","நூ","நெ","நே","நை","நொ","நோ","நௌ",
"ப","பா","பி","பீ","பு","பூ","பெ","பே","பை","பொ","போ","பௌ",
"ம","மா","மி","மீ","மு","மூ","மெ","மே","மை","மொ","மோ","மௌ",
"ய","யா","யி","யீ","யு","யூ","யெ","யே","யை","யொ","யோ","யௌ",
"ர","ரா","ரி","ரீ","ரு","ரூ","ரெ","ரே","ரை","ரொ","ரோ","ரௌ",
"ல","லா","லி","லீ","லு","லூ","லெ","லே","லை","லொ","லோ","லௌ",
"வ","வா","வி","வீ","வு","வூ","வெ","வே","வை","வொ","வோ","வௌ",
"ழ","ழா","ழி","ழீ","ழு","ழூ","ழெ","ழே","ழை","ழொ","ழோ","ழௌ",
"ள","ளா","ளி","ளீ","ளு","ளூ","ளெ","ளே","ளை","ளொ","ளோ","ளௌ",
"ற","றா","றி","றீ","று","றூ","றெ","றே","றை","றொ","றோ","றௌ",
"ன","னா","னி","னீ","னு","னூ","னெ","னே","னை","னொ","னோ","னௌ"
]

 